# 2) რაში გვეხმარება ინდექსინგი? რა შეგივიძლია გავაკეთოთ ინდექსინგის მეშვეობით? შეგვიძლია თუ არა სტრინგების შეცვლა ინდექსინგით?

# ინდექსინგი საშუალებას გვაძლევს მივწვდეთ კონკრეტულ ელემენტს სიიდან (list), სტრინგიდან (string) ან სხვა მსგავსი მონაცემების ტიპიდან.
# ყოველი ელემენტს აქვს თავისი ნომერი, ანუ ინდექსი, რომლის მიხედვითაც ვიგებთ, რომელ პოზიციაზეა ის და შეგვიძლია მივწვდეთ მას.
# ინდექსის მეშვეობით შეგვიძლია:
# წავიკითხოთ კონკრეტული ელემენტი
# შევცვალოთ ელემენტი (მხოლოდ ისეთ ტიპებში, რომლებიც ცვალებადია, როგორიცაა list).
# გამოვიყენოთ უარყოფითი ინდექსი ბოლო ელემენტების წასაკითხად.


