
# 1)დავალება: გამოიყენე for ციკლი, რომ დაბეჭდო რიცხვები 1-დან 10-მდე.
# 2)დაბეჭდე სიტყვა "Hello world" ხუთჯერ, ყოველი დაბეჭდვა ახალ ხაზზე.
# 3) გამოიყენე for ციკლი, რომ დაბეჭდო მხოლოდ ლუწი რიცხვები  10.
# 4)უყურეთ ჩანაწერს
# 5)და კომენტარებით ახსენი რა არის for loop 


# 1)დავალება: გამოიყენე for ციკლი, რომ დაბეჭდო რიცხვები 1-დან 10-მდე.

for i in range(1, 11):
     print(i)


# 2)დაბეჭდე სიტყვა "Hello world" ხუთჯერ, ყოველი დაბეჭდვა ახალ ხაზზე.
print("Hello world")
print()
print("Hello world")
print()
print("Hello world")
print()
print("Hello world")
print()
print("Hello world")



# 3) გამოიყენე for ციკლი, რომ დაბეჭდო მხოლოდ ლუწი რიცხვები  10.
for i in range(1, 11):
    if i % 2 == 0:
        print(i)


# 5)და კომენტარებით ახსენი რა არის for loop 
# ახსნა
# for loop გამოიყენება ერთი და იმავე კოდის მრავალჯერ შესასრულებლად, როცა ვიცით რამდენჯერ უნდა შესრულდეს

 

