#x = 2
#y = 20

#print(y // x)

# name = "nika"
# age = 15
# print(name + " " + str(age))


# 1)ახსენით რა განსხვავებაა implicit და explicit datatype comversion-ში.
# 4)შექმენით პროგრამა რომელიც მიიღებს მომხარებლისგან input-ს რიხვის სახით და დაბეჭდეთ ამ რიცხვამდე ყველა რიცხვი თანმიმდევრობით. (For loop),
# 5)გააკეთეთ მეოთხე დავალება While loop-ის გამოყენებით.






# 1)
# implicit - კომპიუტერის მიერ ხდება, ადამიანის ჩარევის გარეშე
# explicity - ხდება მაშინ, როცა პროგრამისტი თავად მიუთითებს გარდაქმნის საჭიროებას.


# 4)
num = int(input("შეიყვანეთ რიცხვი: "))

for i in range(num + 1):
    print(i)

# 5)
num = int(input("შეიყვანეთ რიცხვი: "))

i = 0

while i <= num:
    print(i)
    i += 1