# 1)მომხმარებელს შემოატანინეთ 3 რიცხვი და გამოიტანეთ მაგ სამი რიცხვის ჯამი 
# 2)დაბეჭდეთ რიცხვები 10 - 1 მდე 
# 3)დაბეჭ დეთ 1- 100 რიცხვი მხოლოდ კენტები 
# 4)დაბეჭდეთ ყველა რიცხვი რომელიც 3 ზე უნაშთოდ იყოფა 1 დან 100 მდე 
# 5)იპოვეთ 1 - 100 რიცხვის ჯამი 


 # 1)
num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
num3 = float(input("შეიყვანეთ მესამე რიცხვი: "))

sum_result = num1 + num2 + num3

print("სამი რიცხვის ჯამია:", sum_result)



# 2)
for i in range(10, 0, -1):
    print(i)


# 3)
for i in range(1, 101, 2):
    print(i)

# 4)
for i in range(1, 101):
    if i % 3 == 0:
        print(i)


# 5)
sum_result = 0

for i in range(1, 101):
    sum_result += i

print("1-დან 100-მდე რიცხვების ჯამია:", sum_result)


