# 1) გააკეთეთ პატარა გულის ცემის სისტემა რომელიც ითვლის რა თქმა უნდა გულის ცემას  თუ 180 ზე 
# მეტია ამ შემთხვევაში მაღალია თუ 160-დან 170 მდე არის ამ შემთვევაში არის ნორმალური თუ 160-ზე ნაკლებია ამ შემთხვევაში დაბალი




heart_rate = int(input("enter your heart rate"))

if heart_rate == 180:
    print("high")
elif heart_rate > 160 and heart_rate < 170:
    print("normal")
elif heart_rate < 160:
    print("low")


# 2)შექმენი პროგრამა, რომელიც მომხმარებლის მიერ შეყვანილი ასაკის მიხედვით დაადგენს, რომელი ასაკობრივი ჯგუფის წევრია ადამიანი.
# თუ ასაკი უარყოფითია — გამოიტანე: "არასწორი ასაკი"
# თუ ასაკი ნაკლებია 13-ზე — გამოიტანე: "ბავშვი"
# თუ ასაკი არის 13-დან 19-ის ჩათვლით — გამოიტანე: "თინეიჯერი"
# თუ ასაკი არის 20-დან 59-ის ჩათვლით — გამოიტანე: "ზრდასრული"
# თუ ასაკი არის 60 ან მეტი — გამოიტანე: "პენსიონერი"



age = int(input("enter age"))

if age < 0:
    print("wrong age")
elif age < 13:
    print("kid")
elif age > 13 and age < 19:
    print("teenager")
elif age > 20 and age < 59:
    print("ზრდასრული")
else:
     print("პენსიონერი")
