# 1) შექმენი for loop- რომელიც გამოიტანს 1-100 ჩატვლით რიცხვებს და ასევე კენტია თუ ლუწი ეს რიცხვი.
# 2) მომხმარებელს შემოატანინეთ რიცხვი და და გამოიტანეთ ეს რიცხვი კენტია თუ ლუწი
# 3) მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ 'მეტია' თუ მეორე რიცხვი პირველზე მეტია თუ არადა დაბეჭდეთ  ''ნაკლებია"
# 4) მომხმარებელს შემოატანინეთ სამი ორი რიცხვი და დაბეჭდეთ უფრო მაღალი რიცხვი


# 1)
for i in range(1, 101):
    if i % 2 == 0:
        print(f"{i} - ლუწი")
    else:
        print(f"{i} - კენტი")

# 2)
number = int(input("შეიყვანე რიცხვი: "))

if number % 2 == 0:
    print(f"{number} - ლუწი")
else:
    print(f"{number} - კენტი")

# 3)
a = int(input("შეიყვანე პირველი რიცხვი: "))
b = int(input("შეიყვანე მეორე რიცხვი: "))

if b > a:
    print("მეტია")
else:
    print("ნაკლებია")

# 4)
a = int(input("შეიყვანე პირველი რიცხვი: "))
b = int(input("შეიყვანე მეორე რიცხვი: "))

if a > b:
    print(f"უფრო მაღალია: {a}")
else:
    print(f"უფრო მაღალია: {b}")