# 1) იგივე ქლასვორქები როგორც day7 ში მაგრამ for loop ით
#  1) შექმენით უსასრულო while loop
# 2) გამოიტანეთ მომხმარებლის შემოყვანილი სახელი 10-ჯერ იტერაციის მეშვეობით
# 3) შექმენით while loop და კომენტარად მიაწერეთ რომელია თავი და რომელი სხეული
# 4) მომხმარებელს შემოაყვანინეთ რიცხვი, სანამ ეს რიცხვი არ იქნება 100-ზე მეტი მაქამდე თავიდან მოთხოვთ რიცხვის შემოტანა
# 5) მომხმარებელს შემოატანინეთ სხვადასხვა სახელები 5-ჯერ იტერაციის მეშვეობით, შექმენით ამ სახელებისთვის ცვლადი რომელშიც ყოველი სახელი დაემატება და ეს სახელები გამოიყოფა მძიმეებით, ანუ თქვენი ცვლადი 5 სახელის შეყვანის შემდეგ უნდა გამოიყურებოდეს ასე: "{სახელი პირველი}, {სახელი მეორე}, ... {სახელი მეხუთე}"





#  1) შექმენით უსასრულო while loop
# SKIP

# 2) გამოიტანეთ მომხმარებლის შემოყვანილი სახელი 10-ჯერ იტერაციის მეშვეობით
name = input("შეიყვანეთ თქვენი სახელი: ")

for i in range(10):
    print(name)

# 3) შექმენით for loop და კომენტარად მიაწერეთ რომელია თავი და რომელი სხეული

# ციკლის თავი: განსაზღვრავს რამდენჯერ უნდა შესრულდეს ციკლი
for i in range(5):
    # ციკლის სხეული: ეს კოდი შესრულდება ყოველი იტერაციის დროს
    print("ეს არის ციკლის სხეული", i + 1)

# 4) მომხმარებელს შემოაყვანინეთ რიცხვი, სანამ ეს რიცხვი არ იქნება 100-ზე მეტი მაქამდე თავიდან მოთხოვთ რიცხვის შემოტანა
# SKIP

# 5) მომხმარებელს შემოატანინეთ სხვადასხვა სახელები 5-ჯერ იტერაციის მეშვეობით, შექმენით ამ სახელებისთვის ცვლადი რომელშიც ყოველი სახელი დაემატება და ეს სახელები გამოიყოფა მძიმეებით, ანუ თქვენი ცვლადი 5 სახელის შეყვანის შემდეგ უნდა გამოიყურებოდეს ასე: "{სახელი პირველი}, {სახელი მეორე}, ... {სახელი მეხუთე}"


names = []


for i in range(5): 
    name = input(f"{i + 1}) შეიყვანეთ სახელი: ")
    names.append(name)

result = ", ".join(names)

print("შეყვანილი სახელებია:", result)
