# 4) გააკეთეთ ეს ამოცანა:
# იპოვე ლუწი რიცხვები და მიიღე ქულები!
# წესები:
# მოცემულია რიცხვების Tuple (3, 6, 8, 1, 9, 12, 4).
# ლუწი რიცხვი არის ისეთი, რომელიც 2-ზე უნაშთოდ იყოფა.
# ყოველი ლუწი რიცხვის პოვნაზე მიიღებ 1 ქულას.
# დაბეჭდე ლუწი რიცხვები და ბოლოს აჩვენე, რამდენი ქულა დააგროვე.
# ახსენით დავალება კომენტარებით.




numbers = (3, 6, 8, 1, 9, 12, 4)

score = 0

for num in numbers:
    if num % 2 == 0:
        print("ლუწი რიცხვი:", num)
        score += 1

print("სულ დააგროვე ქულები:", score)