# დავალება 1: წნევის ანალიზი
# მომხმარებელი შეიყვანს ორ მაჩვენებელს: სისტოლური და დიასტოლური წნევა.
# პროგრამამ უნდა განსაზღვროს წნევის კატეგორია:

# თუ სისტოლური > 140 ან დიასტოლური > 90 → "მაღალი წნევა"

# თუ სისტოლური < 90 ან დიასტოლური < 60 → "დაბალი წნევა"

# სხვა შემთხვევაში → "წნევა ნორმალურია"

qveda = int(input("შეიყვანეთ ქვედა წნევა: "))
zeda = int(input("შეიყვანეთ ზედა წნევა: "))

if zeda > 140 or qveda > 90:
    print("მაღალი წნევა")
elif zeda < 90 or qveda < 60:
    print("დაბალი წნევა")
else:
    print("წნევა ნორმალურია")


# თუ ასაკი < 10:

# წონა < 20 → "წონა დაბალია"

# წონა 20-40 → "წონა ნორმალურია"

# წონა > 40 → "წონა მაღალია"

# თუ ასაკი 10-17:

# წონა < 40 → "წონა დაბალია"

# წონა 40-65 → "წონა ნორმალურია"

# წონა > 65 → "წონა მაღალია"

# თუ ასაკი 18 ან მეტი:

# წონა < 50 → "წონა დაბალია"

# წონა 50-90 → "წონა ნორმალურია"

# წონა > 90 → "წონა მაღალია"

# მომხმარებლის შეყვანა
asaki = int(input("შეიყვანეთ ასაკი: "))
wona = float(input("შეიყვანეთ წონა (კილოგრამებში): "))

if asaki < 10:
    if wona < 20:
        print("წონა დაბალია")
    elif wona <= 40:
        print("წონა ნორმალურია")
    else:
        print("წონა მაღალია")
elif asaki <= 17:
    if wona < 40:
        print("წონა დაბალია")
    elif wona <= 65:
        print("წონა ნორმალურია")
    else:
        print("წონა მაღალია")
else:
    if wona < 50:
        print("წონა დაბალია")
    elif wona <= 90:
        print("წონა ნორმალურია")
    else:
        print("წონა მაღალია")

# დავალება 3: ასაკის შეჯერება დღის მონაკვეთთან
# შეიყვანოს მომხმარებელმა ასაკი და საათი (0-დან 23-მდე). პროგრამამ განსაზღვროს:

# თუ ასაკი < 18 და დრო ≥ 22 → "დროა დაძინების"

# თუ ასაკი ≥ 60 და დრო ≥ 21 → "დასვენება რეკომენდებულია"

# სხვა შემთხვევაში → "შეგიძლიათ გააგრძელოთ აქტივობა"

asaki = int(input("შეიყვანეთ თქვენი ასაკი: "))
saat = int(input("შეიყვანეთ საათი (0-დან 23-მდე): "))

if asaki < 18 and saat >= 22:
    print("დროა დაძინების")
elif asaki >= 60 and saat >= 21:
    print("დასვენება რეკომენდებულია")
else:
    print("შეგიძლიათ გააგრძელოთ აქტივობა")



# მომხმარებელი შეიყვანს თავის ასაკს და გულის ცემას.
# პროგრამამ უნდა დაარიგოს ასეთი რჩევები:

# ასაკი < 30 და გულისცემა < 140 → "შეგიძლიათ მეტი ივარჯიშოთ"

# ასაკი ≥ 30 და გულისცემა > 170 → "დასვენება გჭირდებათ"

# სხვა შემთხვევაში → "აქტივობის დონე ნორმალურია"

age = int(input("შეიყვანეთ ასაკი: "))
heart_rate = int(input("შეიყვანეთ გულის ცემა: "))

if age < 30 and heart_rate < 140:
    print("შეგიძლიათ მეტი ივარჯიშოთ")
elif age >= 30 and heart_rate > 170:
    print("დასვენება გჭირდებათ")
else:
    print("აქტივობის დონე ნორმალურია")

# დავალება 5: ასაკი და კვება
# მომხმარებელი შეიყვანს ასაკს. პროგრამა გასცემს კვების რეკომენდაციას:

# 0–12 → "ბევრი ვიტამინიანი საკვები"

# 13–25 → "ენერგიის მომცემი საკვები"

# 26–59 → "ბალანსირებული რაციონი"

# 60+ → "დაბალკალორიული და მსუბუქი საკვები"

age = int(input("შეიყვანეთ თქვენი ასაკი: "))

if 0 <= age <= 12:
    print("ბევრი ვიტამინიანი საკვები")
elif 13 <= age <= 25:
    print("ენერგიის მომცემი საკვები")
elif 26 <= age <= 59:
    print("ბალანსირებული რაციონი")
elif age >= 60:
    print("დაბალკალორიული და მსუბუქი საკვები")
else:
    print("ასაკი არასწორადაა შეყვანილი")